output/merged-1.yml
---
execution:
- concurrency: 1
  hold-for: 2m
  locations:
    eu-west-1: 1
  ramp-up: 0m
  scenario: google
modules:
  cloud:
    browser-open: start
    timeout: 7s
    token: '********'
provisioning: cloud
scenarios:
  google:
    data-sources:
    - delimiter: ','
      loop: true
      path: /path/data.csv
    keepalive: false
    requests:
    - label: homepage
      url: https://www.google.com
    retrieve-resources: false
    think-time: 0.75